[Killed] BlockStatement
src/operacoes.js:17:22
   return Math.sqrt(n);
 }
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
-function fatorial(n) {
-    if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
-    if (n === 0) return 1;
-    if (n === 1) return 1;
-    let resultado = 1;
-    for (let i = 2; i <= n; i++) {
-        resultado *= i;
-    }
-    return resultado;
-}
+function fatorial(n) {}
 function mediaArray(numeros) {
   if (numeros.length === 0) return 0;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: undefined

[Killed] EqualityOperator
src/operacoes.js:19:9
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
 function fatorial(n) {
     if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
-    if (n === 0) return 1;
+    if (n !== 0) return 1;
     if (n === 1) return 1;
     let resultado = 1;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] ConditionalExpression
src/operacoes.js:19:9
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
 function fatorial(n) {
     if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
-    if (n === 0) return 1;
+    if (true) return 1;
     if (n === 1) return 1;
     let resultado = 1;
killedBy: Suíte de Testes Fraca para 50 Operações Aritméticas 8. deve calcular o fatorial de um número maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1
